[
  {
    "title": "Using Hoots and BB bots for Data ops",
    "content": "",
    "url": "https://docs.data.world/en/160693-using-hoots-and-bb-bots-for-data-ops.html"
  },
  {
    "title": "About Hoots and BB bots",
    "content": "Only users with the Organization Administrator privilege can manage hoots and BB Bots.\nTo increase the trust and confidence of your data consumers, add a trust badge on the dashboards, called a Hoot. Hoots let you curate the parts of the catalog that are important to the data consumers and surface them easily on the dashboards. These provide real-time information to users on the assets, without having to consult the catalog or constantly monitor channels like emails and slack messages for current status.\nThe Hoot badges are designed to be very simple, and provide 3 types of indicators to the users:\nHappy - Green status: The data is healthy and has no known issues.\nWarn -Yellow status: Is a warning that there might be issues and someone is looking into them and use the data with caution.\nSick - Red status: There are serious issues with the data and it needs attention.\nThese badges are available to all users even if they do not have access to the complete catalog. Users with the catalog access will be able to pop open a more detailed view go get detailed information about the resource from the catalog.\nSetting up a hoot is as simple as going to a resource in the catalog and clicking the Configure hoot button for it. For each Hoot, a corresponding BB Bot gets created in the Hoot Admin space. To further enhance the experience of the Hoot, you can create BB Bots manually and connect them with the hoot. You would want to do this in scenarios such as 1. you want to have the Hoot get more frequently updated than the catalog status update intervals. 2. You have not cataloged all the parts of the data pipeline.\nThe system provides an easy way to integrate with dbt cloud jobs. For example, let us say you have streaming data from your online sales that need to monitored more frequently because it is being used in some high value dashboards to make crucial business decisions through the day. For that reason you may have set a dbt job to run hourly. BB Bots provide a seamlessly integration with dbt cloud which allows you to hook into your jobs. We automatically map the outcomes of those jobs (OK, warn, error) to the states of the hoots (Happy, Sad, and Sick).\nThe BB Bots allows the data engineers to be proactive and quickly let stakeholders know about the state of things through automated real-time monitors. This way, data consumers stay aware of any issues proactively while data engineers can focus on investigating and addressing the root cause.\nFor more insights from our product experts, watch \"Is my data OK?\" Gain visibility into Schrödinger's data box through automated data health updates\nHoots provide trust in the governance of the data product. If a stakeholder sees the Hoot they know the product is being monitored by the data team and they can quickly get a color-coded signal regarding the health of the data product. Red = sick, Green = happy, Yellow = sad. These correspond with the Negative, Positive, and Neutral asset status available for catalog resources.\nThe BB Bots provide a way for the DataOps team to chain together real-time monitoring and messaging from various sources - so even more than the catalog status.\nHoot Usage gives data teams a quick pulse on their ROI and which products are getting utilized.\nBusiness users: As data and analytics are being pushed to more and more rank-and-file employees, people with little to no data literacy are now expected to make sense of this information. The hoots provide the simplest, lowest cognitive load way for these users to know if they can trust a report. And if they have a question, they can see the Hoot as the icon for help and trust in data.\nData teams: Data teams have to be reactive as business needs for data change constantly. Business priorities and initiatives are fluid. Data teams also have to contend with the rise of \"shadow BI\" - people promoting alternate data to support their personal theories or agendas. The hoots are data teams' stamp of approval on a report, signaling to users that the information could be trusted.\nAs a business user or stakeholder, you need to quickly understand if the data product is trustworthy and governed. I want to know quickly if there are any known issues, what the terms mean, and where I can find more information. The Hoot helps you trust and understand.\nAs a data team member, you need to quickly communicate known issues in your data pipeline that affect the status or health of a data product. You also don’t want to have to answer the same questions over and over and want to spend your time doing more proactive work, rather than reacting to questions that the catalog could answer for the user. The BB Bots help you communicate trust and encourage more self-service by utilizing the catalog.\nAs a data team or data product manager, you need to understand which reports are the most utilized so that you can monitor them and keep them healthy. You also need to understand which are the least utilized so that you can decide what to deprecate and retire. You also need to see which have the most downtime status, so you can understand where to prioritize my team's work. The Hoots Usage helps me make decisions about how to manage my data products.\ndata.world University!\nCheck out our DataOps and BB Bots course.",
    "url": "https://docs.data.world/en/160694-about-hoots-and-bb-bots.html"
  },
  {
    "title": "Technical Overview: Data pipeline concepts",
    "content": "To prepare the data used in a given data product, the data pipeline goes through a series of data processing steps that extract the data from one place, do some transformations on the data, and/or load the data in some other place to be used by the next data processing step. This is what is referred to as ETL (Extract, Transform, Load). For example, a data pipeline may look like this.\nFor each data processing step, you can configure a BB bot to watch for the successful execution of that step and to collect specific information related to the execution (bb bot metadata). Each bb bot reports its information to the hoot app. The hoot app maintains an association between bb bots and the hoots for the reports that use the output data produced by its associated data processing step, either directly or indirectly.\nWhen a bb bot reports some issue with the data or with the execution of the data processing step, the hoot app forwards that information to the hoots that are associated with that bb bot. The hoot app automatically updates the hoot Badge to reflect the new information.\nYes!\nIn cases where the data produced by some data processing step is used by multiple reports, the hoot for each report can be connected to the bb bot related to that data processing step. When the BB bot indicates a concern with the data processing, all hoots will be informed of the situation.\nFor example, in the pipeline above, a BB bot associated with the Tableau extract will report any issues to the hoot associated with the Tableau report. If the analyst develops another dashboard that uses the same Tableau extract, then the hoot for the new dashboard can connect directly to the same Tableau extract BB bot.\nA data processing step extracts data either from direct inputs or from data loaded by another data processing step. When data processing step B extracts data loaded earlier by data processing step A, then you can reflect this relationship in the BB bots for the two steps. hoot allows you to specify this relationship by defining the BB bot for step B as being directly downstream from the BB bot for step A, or equivalently, defining the BB bot for step A as being directly upstream from the BB bot for step B.\nFor example, a BB bot associated with the Python script in the above pipeline would be directly upstream from a BB bot associated with the dbt processing step. A BB bot associated with the dbt processing step would be directly downstream from a BB bot associated with the Python script.\nBy defining the direct upstream-downstream relationships between BB bots, you can build a BB bot model that reflects the actual flow of data in your data pipeline.\nThe BB bot relationships help the hoot app understand the effects of reported issues more accurately, based on a better understanding of the pipeline timing and execution.\nConsider our case above with data processing Step A upstream of data processing step B. When step B reads the output data from step A, this happens at a particular point in time T. Later, Step A may run again and refresh its output. Then, even later at the end of the pipeline, the final product incorporates the version of the data from time T into the final data product. When hoot displays the hoot Badge on the data product, what the hoot Badge shows should reflect the state of the step A BB bot at time T, rather than the state at the time the hoot Badge is being rendered. The upstream-downstream relationships between the BB bots, together with their historical states, enable hoot to take this timing issue into account.",
    "url": "https://docs.data.world/en/163618-technical-overview--data-pipeline-concepts.html"
  },
  {
    "title": "An overview of the Hoot Admin space and Hoot pop-up window",
    "content": "In this walk-through we will introduce you to the various elements of the Hoot Admin space.\nIn the next walk-through we will introduce you to the various elements of the Hoot pop-up window that opens when the user clicks the Hoot badge.\nFor best experience open this walk-through in full screen mode.\nFirst, plan how you want to use hoots and BB bots:\nIdentify the resources in the catalog for which you want to create hoots.\nDecide if you want to inform users only based on catalog status or from other items in the data pipeline. Based on this decision, you will create additional BB Bots and dbt jobs and monitors (if you use DBT).\nCreate a hoot from the resource page in the catalog. A hoot gets created and shows in Hoots list in the Hoot Admin. A BB bot for the hoot is automatically created.\nEmbed the hoot in the data product for which you built it.\nChange the status of the resource which automatically changes the status of the hoot. Alternatively, change the status of the hoot manually from the Hoot page to temporarily over ride the automatic status set by the catalog.\nCreate additional BB bots and attach to the hoot to influence the hoot status.\nIf you use DBT, create and dbt jobs and monitors.\nWhen user uses the dashboard, let us say in Tableau, they will see the Hoot displaying the status. The end-user does not have to be logged in to see the Hoot stamp and status. However, they will need to login if they want to see the Hoot pop-out (For example terms, metrics, and other metadata). This is because we have to identify the user to understand if they have view permissions on the metadata records of the resource.",
    "url": "https://docs.data.world/en/160695-an-overview-of-the-hoot-admin-space-and-hoot-pop-up-window.html"
  },
  {
    "title": "Managing Hoots",
    "content": "Only users with the Organization Administrator privilege can manage hoots and BB Bots.\nHoots are the main feature that the data product users interact with. They have a 1:1 relationship with the cataloged resource. When a user clicks on a Hoot badge in their BI dashboards, a Hoot details page pops up. This small page provides the end-user with more information (link to the catalog, lineage, related glossary terms, etc).\nThe badge is an embeddable web object that can be added to any data product (for example, Tableau Dashboards, Power BI Reports, etc.) that allows tiled or floating web objects.\nTo create a hoot:\nBrowse to the resource for which you want to configure the hoot.\nCheck if the Resource has a status. If not, you must consider setting a Status as the status of the resource in the catalog determines the status of the hoot.\nFrom the Settings tab, go to the Hoots section. Click the Configure Hoot button.\nA hoot is automatically created for the resource and the hoot details page opens. The hoot has the same status as the resource. A corresponding BB Bot also gets created for the hoot.\nIf the resource does not have a status configured, the hoot is created with a Sad status (yellow color).\nClick the Manage tag button to assign tags to the hoot. From the Manage tag window, select an existing tag or type in a new tag name and assign it to the hoot.\nClick the Preview button to see a preview of the Hoot on a web page.\nClick the View in data.world button to go back to the resource in data.world.\nTo embed the hoot:\nFrom the Hoot details page, copy the Hoot URL or the Markdown for the hoot. The selection will depend on what is supported by the application where you are embedding the hoot.\nGo the application where you want to embed the hoots and follow the instructions of the application to add the Hoot using markdown or using an embeddable URL.\nDisable a hoot if you want to stop using it temporarily. Once disabled, the Hoot badge will show the disabled status on the pages where you have embedded the hoot.\nTo disable a hoot:\nIn the Hoots Admin, browse to the Hoots list.\nLocate the hoot you want to disable. Click the hoot to open the Hoot details page.\nClick the Edit button.\nIn the Edit Hoot window, click the Disable hoot boot. Click Save.\nThe Hoot details page now indicates that the hoot is disabled. Simply click the Enable button to re-enable the Hoot.\nTo see the list all disabled hoots, change the filter on Hoots list page to Disabled.\nTo connect BB Bots with a hoot:\nOn the Hoot details page, click the Connect Hoot button available in the right sidebar.\nIn the Connect Hoots window, select the BB Bots for the hoot. Click the Update Hoot button.\nThere are different ways in which the hoot status can changes:\nWhen the status of resource is changed in the catalog. Anytime the status of the connected resource is changed in the catalog, the hoot status changes immediately to reflect the latest status to the users of the data product where the hoots are embedded.\nWhen the status of hoot is changed manually from Hoot Admin app. A hoot admin can decide to intervene in the automatic updates to intentionally inform the data product users about a status that is not reflected by the automated updates. For example, when a hoot a sick and all the issues are resolved, it might take for the automated process to be informed about the latest happy status. In such cases, the hoot admin can change the status to Happy manually so that the data product users can start using the dashboards with confidence. The manual chages are over written as soon as their an automatic update received from the data source.\nWhen you have other BB bots connected with the hoot and their status changes. When there are other BB Bots connected with the hoot - the most severe status takes effect.\nAction\nBB Bot 1 status\nBB Bot 2 status\nHoot status\nA new hoot with two connected BB Bots are set and the status for all is Happy\nResult:\nHoot is Happy\n\n\n\nThe status of BB Bot 2 changes to Sick automatically.\nResult:\nHoot becomes Sick.\n\n\n\nThe status of BB Bot 1 changes to Sad automatically.\nResult:\nHoot stays Sick as that is the most severe status.\n\n\n\nHoot admin manually over writes the status of the hoot to be Happy\nResult:\nHoot becomes Happy because of manual over-write.\n\n\n\nThe status of BB Bot 1 changes to Sad automatically.\nResult:\nThe manual over-write is removed because of new status update on BB Bot 1.\nHoot becomes Sick because that is the most severe status derived from connected bots.\n\n\n",
    "url": "https://docs.data.world/en/160696-managing-hoots.html"
  },
  {
    "title": "Managing BB bots",
    "content": "For each Hoot a corresponding BB Bot gets created automatically in the Hoot Admin space. To further enhance the experience of the Hoot, you can create BB Bots manually and connect them with the hoot. You would want to do this in scenarios such as:\nYou want to the Hoot get more frequent updates than the catalog status update intervals.\nYou have not cataloged all the parts of the data pipeline but you want to use them to influence the Hoot status.\nOne of the coolest features is the ability for data ops teams to build out a group of BB Bots to listen to their pipeline. For example, they could setup a Python load process that connects to all of the dbt Jobs. Then the team can setup various dbt ETL processes BB Bots and connect them to the corresponding catalog BB Bots. This gives you a full pipeline monitoring system outside of just the catalog status.",
    "url": "https://docs.data.world/en/160697-managing-bb-bots.html"
  },
  {
    "title": "Creating BB Bots and connecting to hoots",
    "content": "Only users with the Organization Administrator privilege can manage hoots and BB Bots.\nCreate custom BB bots to connect to systems to gather live information and feed into existing hoots.\nTo create a BB Bot:\nFrom the Hoot Admin space, browse to BB Bots. Here you will see a list of existing BB Bots.\nClick the Create a BB Bot button.\nIn the Create a BB Bot window, set the following and click Save.\nName: Provide a name.\nDescription: Provide a brief description.\nConnected hoots: Select the hoots that the BB Bot will influence.\nSet a BB bot timeout: If you enable this, the BB Bot will be set to sick if it does not run when expected.\nSwitch to Sick after: Specify the timeout duration in hours.\nDisable a BB Bot if you want to stop using it.\nTo disable a BB Bot:\nIn the Hoots Admin, browse to the BB Bots list.\nLocate the BB Bot you want to disable. Click the BB Bot to open the BB Bot details page.\nClick the Edit button.\nIn the Edit BB Bot window, click the Disable BB Bot boot. Click Save.\nThe BB Bot details page now indicates that the hoot is disabled. Simply click the Enable button to re-enable the BB Bot.\nTo see the list all disabled hoots, change the filter on the BB Bot list page to Disabled.\nAfter the BB Bot is all set-up and connected to the external system for receiving updates connect it to the Hoot that should be influenced by the updates.\nTo connect a BB bot to a hoot:\nOn the BB bot details page, click the Connect Hoot button available in the right sidebar.\nIn the Connect Hoots window, select the hoots for the BB Bot. Click the Update BB Bot button.",
    "url": "https://docs.data.world/en/163813-creating-bb-bots-and-connecting-to-hoots.html"
  },
  {
    "title": "Connecting the BB Bot to an external system",
    "content": "After configuring the BB Bot connect it to the external system from where it will get status updates.\nYou need to have some technical know how and ability to work with APIs to be able to connect BB Bots to your external system.\nTo get the API URL and API token for the BB Bot:\nCopy the API URL for the BB Bot and API Token and use it in the external system to send updates programatically to the data.world system.\nNote that the API token available on the BB Bot page is associated with the user account setting up the BB Bot. As a best practice we recommend creating a special Service Account for BB bots and use the API token for that account for configuring your APIs.\nIn this section we explain how you can use the BB Bot API using Postman. You can use any tool of your choice.\nIn Postman, create a new get request. Paste the API URL for the BB bot and hit Send.\nTo update information within the BB Bot, we need to submit a POST request.\nTo do this in Postman:\nIn Postman, create a post request. Paste the API URL for the BB bot. Go to Authorization tab, choose Bearer Token, and paste the API Key for the BB bot.\nOn the Parameters tab, provide the parameters for the API.\nParameter\nDescription\nstate\nthe current BB Bot state. Value options are- happy, sad, or sick.\nuser_message\nA message for the Hoot badge. Maximum 80 character are allowed.\nhistory_note\nAn internal note added to the history to explain the current changes.\nprivate_entry\nIf this is passed as true, the history_note will not be visible to the end users viewing a connected Hoot popup. The messages is present on the BB Bot page in the Hoot Admin space.\nmeta\nYou can optionally pass along metadata that can contain any data that you want associated with BB Bot.\nWhen the API calls include metatdata that matches the following format, the information is included on the Analytics page of the BB Bot in the Hoot Admin space.\nParameter\nDescription\nlatest_record_at\nor\nmeta[latest_record_at]\nThe value is the time of the latest record. It is sent to the connected Hoots to display on the Hoot badge.\ncounts[count_name]\nor\nmeta[counts][count_name]\nThis is a way to track counts of items over time.\nmeta[yourkey]\nCreate a new key and value that will be saved in the BB Bot history.\nIn the following example, we are setting the state of the BB bot to Sick.\nView the results in the Hoot Admin space.",
    "url": "https://docs.data.world/en/163617-connecting-the-bb-bot-to-an-external-system.html"
  },
  {
    "title": "Creating and managing service accounts for BB bots",
    "content": "This section walks you through the process of creating a service account for your BB bots.\nTo create a service account:\nOn the Organization profile page, go to the Settings tab.\nFrom the Service accounts section, click the Add service account button.\nIn the Create a new service account window, set the following and click Create.\nService account name: This is the name with which the account gets created.\nToken expiration: Set an expiration timef rame. Options available are 1 year, 1 month, 1 week, and Never. The generated token expires on the set time and will need to be regenerated again.\nOnce the service account is created, you are prompted to note down the Service account token.\nYou must note down this token and the expiration date before closing the window as this token cannot be retrieved after the window is closed.\nThis is the account you will use for the BB bot APIs.\nTo manage the service account:\nGo to the organization for which you created the service account.\nIn the Members tab, you will see the service account. Add this account to the Organization Admin group.\nCaution should be used while refreshing the service accounts. Refreshing the token invalidates any usages of the existing token attached to this service account.\nTo refresh an access token:\nOn the Organization profile page, go to the Settings tab.\nFrom the Service accounts section, locate the account you want to refresh.\nOpen the Three dot menu and click the Refresh button.\nCaution should be used while deleting service accounts. Deleting this service account will cause the BB Bots to stop working.\nTo delete a service account:\nOn the Organization profile page, go to the Settings tab.\nFrom the Service accounts section, locate the account you want to delete.\nOpen the Three dot menu and click the Delete button.",
    "url": "https://docs.data.world/en/130574-creating-and-managing-service-accounts-163771.html"
  },
  {
    "title": "Set up BB bots that depend on other BB bots",
    "content": "Many companies use a data collection process that takes many hours to complete, and then reports are updated with new data. A classic example of this would be having a daily ETL process followed by an update of data (more specific example: you run a daily data pipeline, and then extract this data into Tableau).\nA BB bot can be connected to one or more Upstream BB bot. When the current BB bot is updated through the API, it then will take into account information from its Upstream BB bots.\nSet up upstream BB bots:\nIn this example, we create two BB bots - Data pipeline and Extract\nNext, we set the Data Pipeline BB bot to be Upstream from the Extract BB Bot. On the Extract BB Bot page, click the Connect Upstream BB Bots button. In the Connect Upstream BB Bots window, select the Data pipeline BB bot.\nConnect the Extract BB bot to a Hoot.\nWhen an API updates, the Extract BB bot and information from Upstream BB bots, such as meta[lastest_record_at] and state are used to compute the current value for the Extract BB Bot.\nLet us walk through some changes and see what happens to the connected Hoot.\nSuccess scenario\nAfter being setup, one connected Hoot has a Happy state.\nLet us say the Data Pipeline runs, and sets the meta[lastest_record_at] record. Nothing changes yet on the connected Hoot, because an API hasn’t updated the Downstream BB Bot yet.\nThe extract runs and calls the API on the Extract BB bot to say that everything is Happy. Now, since there is no latest_record_at set on the Extract BB bot, it consults the Upstream BB bots to find the latest latest_record_at value, and uses this for the Hoot. The Hoot state is Happy.\nFailure scenario\nLet us say, the next day the Data Pipeline fails. The Pipeline BB bot is Sick, but nothing changes yet on the connected Hoot because an API hasn’t updated our Downstream BB bot yet.\nThen the extract runs and calls the API on the Extract BB bot to say that everything is Happy. But, first it consults Upstream BB bots to find the latest state value, and uses this for the Hoot, hence making it Sick.\nOnce the Data Pipeline BB bot turns back Happy, this will propagate with the Downstream Hoots when an API request is made to the Downstream BB bot.\nConclusion\nThis was a simple example using one Upstream BB bot. You can actually attach multiple Upstream BB bots and each of these can have Upstream BB bots of their own. Effectively you can have a whole graph of BB bots attached to your Hoots. If you want to get very granular, feel free to add many Upstream BB bot. But if you just need a few check points, you do not have to add these just for completeness sake. It is probably good to start small and simple, and then build up to the more complex cases as you get the hang of things.",
    "url": "https://docs.data.world/en/163619-set-up-bb-bots-that-depend-on-other-bb-bots.html"
  },
  {
    "title": "Integrating with DBT",
    "content": "The application provides an easy way to integrate with dbt cloud jobs. For example, let us say you have streaming data from your online sales that need to monitored more frequently because it is being used in some high value dashboards to make crucial business decisions through the day. For that reason you may have set a dbt job to run hourly. BB Bots provide a seamlessly integration with dbt cloud which allows you to hook into your jobs. We automatically map the outcomes of those jobs (OK, warn, error) to the states of the hoots (Happy, Sad, and Sick).\nBefore you begin, get the DBT job ID and service token from your DBT instance.\nTo create a DBT job:\nFrom the Hoot Admin space, browse to Integrations.\nClick the DBT integration.\nClick the Add a DBT Job button.\nOn the New DBT Cloud Job screen, provide the following details:\nName: Provide a name for the job.\nDbt job: Provide the job ID. Go to a job run in DBT and find the Job ID in the URL.\nService token: Provide a service token for the DBT account where the job exists. You can generate and access service tokens from your team settings in DBT Cloud.\nClick the Create Dbt cloud job button.\nTo create a DBT job monitor:\nFrom the Hoot Admin space, browse to Integrations.\nClick the DBT integration.\nClick the Create a monitor button.\nOn the New DBT Cloud Monitor screen, provide the following details:\nDbt cloud job: From the dropdown list, select a dbt cloud job configured in data.world.\nMonitor type: Select from Metrics, Models, Sources, Tests, Exposures, Seeds, Snapshots\nMonitor item: Select an item from the dropdown or leave blank to summarize all monitor items. The dropdown will show a list of items that are configured and available in DBT. If you have not configured any item in DBT, the list will be blank.\nSad Hoot message: Provide a short optional message to be displayed on the connected Hoots when sad.\nSick Hoot message: Provide a short optional message to be displayed on the connected Hoots when sick.\nClick the Create Dbt cloud monitor button.\nTo run the monitor:\nOn the DBT Cloud Monitors page, open an existing monitor.\nOn the monitor details page, click the Run. The monitor will continue to automatically run every 30 minutes to check the latest status.\nWhen you run the monitor the first time, it automatically creates a BB Bot for the monitor.\nNext, connect the BB Bot with the appropriate hoot.",
    "url": "https://docs.data.world/en/160702-integrating-with-dbt.html"
  },
  {
    "title": "Creating and adding FAQs to hoots",
    "content": "Add FAQs to Hoots to provide additional context to users when they are interacting with the hoot badge. You can assign an FAQ directly to a hoot or you can assign it to a tag or BB Bot and any hoot that uses the tag or BB Bot will automatically have the FAQ show-up for it.\nFor example, if you have a common tag (for example, sales commission) for all Sales Tableau hoots, associate the FAQ with the tag, sales commission, and all the Hoots using the tag will automatically get the FAQ.\nIn the Hoot Admin space, go to the FAQ section.\nYou are redirected to the list of FAQs already created for the organization.\nClick the New Question button.\nIn the New Question window, set the following:\nQuestion: Provide the question.\nAnswer: Provide the answer to the question.\nPublish to: Select a BB Bot, Hoot, or Tag. You can choose to select these options at a later point. If you select a BB Bot or Tag, any Hoot that uses the Tag or BB Bot will show this FAQ.\nPublish: Select this option to immediately publish the question to the end users. You can choose to publish it later.\nClick Create Question.\nTo assign an FAQ to BB bot, hoots, tags:\nIn the Hoot Admin space, go to the FAQ section.\nOpen an existing FAQ or create a new one.\nOn the FAQ page, click the Edit button.\nOn the Edit article page, in the Publish to field select a BB Bot, Hoot, or Tag and make sure the Publish checkbox is selected.\nClick Update Question.",
    "url": "https://docs.data.world/en/160698-creating-and-adding-faqs-to-hoots.html"
  },
  {
    "title": "Customizing hoots pop-up window with hoot studio",
    "content": "When users with access to the data catalog click the Hoot badge, they are taken to the the Hoot pop-up window that provides them contextual information about the resource from the catalog.\nUse the Hoot Studio to customize the Hoot pop-up window and decide what you want to show or hide from the end users.\nFirst, let us go over the different elements of the Hoot pop-up window. For the best experience open this walk-through in full screen mode.\nTo customize the hoot:\nThe changes made here are immediately reflected to the end users interacting with the hoots.\nFrom the Hoot Admin space, browse to Settings.\nToggle the switch in the Status field to show or hide options on the Hoot page.\nRefresh the browser to see the changes reflect in the Preview section of the page.",
    "url": "https://docs.data.world/en/160699-customizing-hoots-pop-up-window-with-hoot-studio.html"
  },
  {
    "title": "Using hoots in data products",
    "content": "The Hoot Admin must embed the hoot in the data product for the users to be able to see the hoot.\nAs a data product user, browse to the page where the hoot is embedded.\nEveryone will see a Hoot Badge on the page informing them about the status of the data product derived from the catalog and other BB Bots connected to the hoot.\nClick the Hoot Badge to see more details in the Hoot pop-up window. Only users with access to the catalog in data.world will be able to click the Hoot Badge and see more details about it. If the user does not have access to the specific resource in the data catalog, they will see a 404 page.\nIf you do not have a data.world account, you will have to get an account in data.world to see the details in the Hoot pop-up window.",
    "url": "https://docs.data.world/en/163643-using-hoots-in-data-products.html"
  },
  {
    "title": "Viewing hoots and BB bots usage reports",
    "content": "View the usage data for hoots for the last 7, 14, 30, 60, and 90 days to evaluate how the hoots are performing. The report tells you the current status of the hoot, when it was last updated, number of views and clicks, and the percentage up-time for the hoot.\nIf you want to drill down into how individual hoot and BB Bot are performing, access the Analytics for each of them from their individual pages.\n",
    "url": "https://docs.data.world/en/160700-viewing-hoots-and-bb-bots-usage-reports.html"
  }
]