[
  {
    "title": "About catalog Toolkit",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.Catalog toolkit is a fast and easy way of setting up the UI for your catalog to meet your business needs -- that is adding custom fields and sections to the UI, adding custom resources, creating subtypes for glossary terms.Your installation is setup with 4 organizations:Catalog Configurationorganization: Where you will create the metadata profile.Catalog Sourcesorganization: This is where you upload your data via collectors, connection manager etc.Catalog Sandboxorganization: This is a preview or QA environment where you can check if you did the setup correctly.Catalog Mainorganization: This is the production organization that the end users see.The data.world team will help set up the initial metadata profile for you in the Configuration organization. This documentation will walk you through the process of maintaining the configurations.Key tasks covered are:Creating a custom field and add to an out-of-the-box resourceMoving the custom field to an out-of-the-box sectionAdding a new subtype for glossaryEnhancing the glossary subtype page with custom sectionCreating custom relationships between resourcesAdding a new custom status",
    "url": "https://implementation.data.world/docs/about-catalog-configuration"
  },
  {
    "title": "Create a custom field and add to an out-of-the-box resource",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.In this tutorial we will add a custom field calledData Stewardand add it toInformationsection of the Business terms page.STEP 1: Create a custom field🚧Perform this task in theCatalog Configurationorganization.On theOrganization profilepage, go to theResourcestab.Click theNew resourcebutton and select theOther resourcesoption.In theAdd new resourcewindow, set the following and clickContinue.a. In theTitlefield, provide a name of the field you want to add. For example, let us add a field calledData Steward.b. From theChoose typesection, select theFreeform metadata fieldoption.c. From theChoose one or more collectionsdropdown, select theMetadata profilecollection.In theEdit resourcewindow, set therest of the propertiesfor the field and click theSavebutton. You can alternatively alsocreate date fieldsorselect fields.STEP 2: Add the field to Business terms pageOn theData Stewardpage, go to the Related tab.ClickAdd related resourceIn theEdit a related resourcewindow, on theTypetab, search and set theTypeasBusiness term. ClickAdd.📘The field is automatically added to theInformationalsection of theBusiness termspage.Publish the changesSee:Publishing changesView the results!🎉🚧Perform this task in theCatalog Sandboxorganization.In theCatalog Sandboxorganization, go theGlossarytab of theOrganization profile pageand create a new glossary term.You will see the page shows the custom fieldData Stewardin theInformationalsection.Click theEditbutton to set value for the field.",
    "url": "https://implementation.data.world/docs/create-a-custom-field-and-add-to-out-of-the-box-section"
  },
  {
    "title": "Add a new subtype for glossary",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.STEP 1: Add a new Type called Metrics🚧Perform this task in theCatalog Configurationorganization.On theOrganization profilepage, go to theResourcestab.Click theNew resourcebutton.In theAdd new resourcewindow, set the following and clickContinue.a. In theTitlefield, provide the name of the subtype asMetric.b. From theChoose typesection, selectType.c. From theChoose one or more collectionsdropdown, select theMetadata profilecollection.In theEdit resourcewindow, set thePluralasMetricssetAbility to create in the UIasAllow UI creation. Click theSavebutton.On theMetricspage,  on theRelatedtab, clickAdd related resource.In theEdit a related resource for the Typewindow, on theTypetab, search and selectBusiness term. ClickAdd.STEP 2: Publish the changesSee:Publishing changesView the results!🎉🚧Perform this task in theCatalog Sandboxorganization.In theCatalog Sandboxorganization, go theGlossarytab of theOrganization profile pageand click theNewbutton.In theAdd new resourcewindow, you will notice the new type - Metric. Type a name for the terms and set the type asMetric.In theEdit resourcewindow, set the following:i.Summary:Provide a summary.ii.Data Steward:Set the data steward for the term you are adding.🚧Note that any resource type that is a subtype of another resourceinheritsall the metadata fields from the parent resource. In our example, theData Stewardfield is inherited byMetricfromBusiness termsasMetricsis a sub type of business terms.",
    "url": "https://implementation.data.world/docs/add-a-new-subtype-for-business-terms"
  },
  {
    "title": "Add custom resource types",
    "content": "❗️Beta feature!This is an Beta feature andis notgenerally available to all customers at this time.Why would I add custom resources?One of the primary ways of organizing data in data.world is by resource types such as tables, datasets, and projects. If there is a specific type of resource not included with data.world that you would like to use, then you can create a custom resource type.Planning your custom resourcesPlan the list of custom resources you need for your organization.Define the type of custom resources.Specify the custom resources users can create from the UI.Add a custom resourceOn the​Organization profile​​page, go to the ​Overview​​ tab or ​Resources​ tab. Click the ​New resource​ button and select ​Other resources.​​In the ​Add new resource​ window, set the following and click ​Continue​​.​In the ​Title​ field, provide a name of the relationship you want to add. For example, let us add a type called ​Bank account.From the ​Choose type​section, select the ​Type​​ option.From theChoose one or more collectionsdropdown, select theMetadata profilecollection.In the ​Edit resource​window, set the following properties and click the ​Save​​ button.​​Plural:​Provide a plural for the field name. For example, ​Bank accounts​​.​​Ability to create in the UI:​ Set this to ​Allow UI creation​​ if you want users to be able to create these type of resources from the UI.Publish the changesSee:Publishing changes.View the resultsIn theSandbox Organization, on the ​Organization profile​​page, go to the ​Overview​​ tab.Click the ​New resource​ button and select ​Other resources.​​In the​​Add new resource​​window, you will notice that the new custom resource is available.Enhance the custom resource pageGo back to theCatalog configurationorganization and add the custom fieldStewardto the ​Bank accounts​​custom resource. Publish the changes to the Sandbox organization and see the enhanced custom resources page.",
    "url": "https://implementation.data.world/docs/add-a-custom-resource"
  },
  {
    "title": "Enhance a resource page with custom section",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.STEP 1: Create a custom sectionThe system comes with 5 out-of-the-box sections - Informational, People, Sidebar, Technical, Explorer Sidebar Metadata. You can view them from theResourcestab by filtering onSections. This will also give you a list of custom sections created in the organization.🚧Perform this task in theCatalog Configurationorganization.To add a new custom section:On theOrganization profilepage, go to theResourcestab.Click theNew resourcebutton.In theAdd new resourcewindow, set the following and clickContinue.a. In theTitlefield, provide a name of the custom section you want to add. For example,Calculations.b. From theChoose typesection, selectSection.c. From theChoose one or more collectionsdropdown, select theMetadata profilecollection.In theEdit resourcewindow, set the rest of the properties for the section and click theSavebutton.STEP 2: Create a custom field🚧Perform this task in theCatalog Configurationorganization.On theOrganization profilepage, go to theResourcestab.Click theNew resourcebutton.In theAdd new resourcewindow, set the following and clickContinue.a. In theTitlefield, provide a name of the field you want to add. For example, let us add a field calledProfit calculation.b. From theChoose typesection, select theMetadata field - freeformoption.c. From theChoose one or more collectionsdropdown, select theMetadata profilecollection.In theEdit resourcewindow, set therest of the propertiesfor the field and click theSavebutton. You can alternatively alsocreate date fieldsorselect fields.STEP 3: Add the custom field to the custom section🚧Perform this task in theCatalog Configurationorganization.On theProfit calculationpage, go to theRelatedtab.ClickAdd related resource. In theEdit a related resourcewindow, go to theSectiontab.Search and select theCalculationssection. ClickAdd.STEP 4: Add the custom field to the resource page🚧Perform this task in theCatalog Configurationorganization.On theProfit calculationpage, go to theRelatedtab.ClickAdd related resource. In theEdit a related resourcewindow, go to theTypetab.In theEdit a related resourcewindow, search and selectMetric.  ClickAdd.Publish the changesSee:Publishing changes.View the results!🎉In theCatalog Sandboxorganization, go theGlossarytab of theOrganization profile page.Either create a newBusiness Metricor select an exiting one.You will notice a new section on the page callCalculationswith the fieldProfit calculations. Edit the field to set a value for it.🚧Perform this task in theCatalog Sandboxorganization.",
    "url": "https://implementation.data.world/docs/enhance-the-glossary-subtype-page-with-custom-section"
  },
  {
    "title": "Create custom relationships between resources",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.In this tutorial we will create a custom relationship between two resources.Why would I do this?The system comes with the following out-of the-box relationships between resources.The first column in the table represents the resource you are viewing and the subsequent columns indicate whether or not it has a default relationship configured for that target resource type. For example, from the business term page, you can relate to Analysis, Columns, Tables, and datasets.Resource ViewAnalysisBusiness termColumnDatasetTableData typeAnalysisNoYesNoYesYesNoBusiness TermYesNoYesYesYesNoColumnNoYesNoNoNoNoDatasetYesYesNoNoYesNoData typeNoYesYes (contact data.world support team for additional details)NoNoNoTableYesYesYesYesNoNoCustom resourcesNoNoNoNoNoNoUse catalog config to add custom relationships between resources that are not related out-of-the-box. Use the following guidelines to plan custom relationships between the resources.Identify the resources you want to relate.Identify if the relationship is bi-directional.Create a relationshipOn the​Organization profile​​page, go to the ​Overview​​ tab or ​Resources​ tab. Click the ​New resource​ button and select ​Other resources.​​In the ​Add new resource​ window, set the following and click ​Continue​​.​In the ​Title​ field, provide a name of the relationship you want to add.From the ​Choose type​section, select the ​Relationship​​ option.From theChoose one or more collectionsdropdown, select theMetadata profilecollection.In the ​Edit resource​window, set the following properties and click the ​Save​​ button.​​Source to target label:​Provide the field name. For example, ​belongs to​​.Source to target label - ​​Plural:​Provide a plural for the field name. For example, ​belong to​​.Target to source label:​ Define this value to set a bi-directional relationship between the two objects in the other. For example, ​contains​​.Target to source label - plural:​​Provide the plural for the bi-directional relationship between the two objects. For example, ​contain​​.On the relationship page that you just created, go theRelatedtab. Click ​​Add related resource​​.​In the window that opens, on theTypetab select the resources for the relationship.In the ​Related type​ field select the resource for which you are creating the relation. From the​Relationship type​ field select​Is a source for this relationship​​.Next, add the second resource in the ​Related type​ field and set the ​Relationship type​ field as​Is a target of this relationship​​.Publish the changesSee:Publishing changes.View the resultsIn theCatalog Sandboxorganization, find any resource for which you enabled the custom relationships.Check if you can relate the resources. If you enabled bi-directional relationships, you will be able to relate the resources from both the resource pages.",
    "url": "https://implementation.data.world/docs/create-custom-relationship"
  },
  {
    "title": "Add a new custom status",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.Add a new custom statusOn theOrganization profilepage, go to theResourcestab.Click theNew resourcebutton.In theAdd new resourcewindow, set the following and clickContinue.a. In theTitlefield, provide a label for the status you want to add.b. From theChoose typesection, selectStatus.c. From theChoose one or more collectionsdropdown, select theMetadata profilecollection.In theEdit resourcewindow, select theStatus type.It can be Positive, Negative, Neutral. This determines if the color of the status - that is - Green (positive), Red (negative), or Gray (neutral).click theSavebutton.Publish the changesSee:Publishing changes.View the resultsIn theCatalog Sandboxorganization, find any resource or glossary term in the organization.Click theEditbutton on the resource page and in theEdit resourcewindow browse to theStatustab. Here you can select the new status that you just added.",
    "url": "https://implementation.data.world/docs/add-a-new-custom-status"
  },
  {
    "title": "Add collection types",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.About types of collectionsUse this feature to leverage different UI presentations for the different types of collections in your organization. For example, if you have a set of domain collections, glossary collections, and source collections, you will most likely have different sets of information you need to present to the users for each of these types of collections. This is when you will use the feature to create the different types of collections and corresponding UI presentations for the collection types.STEP 1: Create new collection typeOn the ​Organization profile​​ page, go to the ​Overview​​ tab.Click the ​New resource​ button and select ​Other resources.​​In the ​​Add new resource​​window, set the following and click ​Continue​​.a. ​In the ​​Title​​ field, provide a name of the field you want to add. For example, let us add a field called ​Domain.​​b. ​From the ​​Choosetype​​ section, select the ​Collection type​​option.c. From theChoose one or more collectionsdropdown, select theMetadata profilecollection.​In the ​​Edit resource​​ window, set the following properties for the field and click the ​Save​​ button.*Plural:​​Provide a plural for the resource type. In this example, it is ​Domains​​.Publish the changesSee:Publishing changes.View the resultsIn theSandbox Organization,on the ​Organization profile​​ page, go to the ​Collections​​ tab.​2. Click the ​New​​ button.In the ​​Create new collection​​ window, you will notice that the new collection type is available.STEP 2: Enhance the collection type with custom fields and custom sectionsCreate acustom section.Create acustom field.Add the field to acustom sectionor to an out-of-the-box section.Associate the field with the collection type by doing the following:a. Go to collection type page and clickAdd a related resourceand select the type of field you want to add.b. In theEdit a related resource for this Collection typewindow select the field you want to add.Publish the changesSee:Publishing changes.View the results🎉In theSandbox Organization, on the ​Organizationprofile​​ page, go to the ​Collections​​ tab.​2. Either select an existingDomaincollection or create a new collection of the typeDomain. You will notice that the new field and new section are available for this collection type.",
    "url": "https://implementation.data.world/docs/add-custom-collection-types"
  },
  {
    "title": "Assign custom icons for custom resources, collections, & business glossary types",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.Why would I do this?Use this feature to assign custom icons to custom resources, collections, and business glossary types. This helps you create a richer UI experience by designating your business specific or emoji icons to the different types of resources in your catalog.You can achieve this by simply using icons available in the data.world icon library, emoji icons, or your special business icons hosted on the web.STEP 1: Plan your custom iconsPlan the resources you want to use the custom iconsYou can use custom icons for:Custom resourcesBusiness glossary typesCollection typesTypes of iconsIcon typesResourceDetailsIcons from data.world icon librarydata.world icon library pageStandard icons shared by data.worldEmoji iconsYou can use any emoji icon available on the web.Emoji can be specified using emoji icons (for example, 🇬🇧, 😀, ↑)Images hosted on the webYou can host an image on the web and use that in the catalog.Use an image that has an aspect ratio of 1:1 (square). The largest display allowed is 260 by 260 pixels so an image of that size is recommended. Images that are a lot smaller may not display correctly and can come out pixelated.STEP 2: Create an iconOn the ​Organization profile​​ page, go to the ​Overview​​ tab or ​Resources​ tab. Click the ​New resource​button and select ​Other resources.​​In the ​Add new resource​ window, set the following and click ​Save​​.​In the ​Title​ field, provide a name of the icon you want to add. For example, let us add an icon called ​Smiley.From the ​Choose type​ section, select the ​Resource Icon​​ option.From theChoose one or more collectionsdropdown, select theMetadata profilecollection.In the ​Edit resource​ window, set one of the following and click ​Continue​​.​🚧If you set the value for more than one field, the icon will be created using the following priority:data.world provided iconEmoji glyph iconIcon hosted on the webUse data.world icon:From the dropdown list, select an available data.world icon. You can see the details of the icons here:https://data.world/ddw-librariesUse emoji glyph:Simply add the emoji icon, like 🇬🇧, 😀, ↑, or any other icon.Specify icon by URL:Host an image on your preferred location and make sure it is accessible on the internet without any login. Then, provide the URL for the icon. For example:https://assets.data.world/assets/wrench-sparkle.380853d6d2d6ead6f656d00a39eb3788.png📘Image size recommendationsUse an image that has an aspect ratio of 1:1 (square). The largest display allowed is 260 by 260 pixels so animage of that size is recommended. Images that are a lot smaller may not display correctly and can come outpixelated.STEP 3: Assign the icon to the custom resource, business glossary type, or collection typeOn the Resource icon page that you just created, go to the Related tab.Click theAdd a related resourcebutton.In theEdit a related resource for this Resource iconwindow, set the following and click theSave changebutton.Typetab: Select a custom resource or Business glossary type to which you want to assign the icon.Collection typetab: Select a custom collection type to which you want to assign the icon.Publish the changesSee:Publishing changes.View the resultsIn theCatalog Sandboxorganization, find or create the resource for which you assigned the custom icon.You will notice that the custom icons are assigned to the resource instead of the generic icon.",
    "url": "https://implementation.data.world/docs/assign-custom-icons-for-custom-resources-collections-business-glossary-types"
  },
  {
    "title": "Create date fields",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.About date fieldsCreate date fields to enable users to set dates in custom fields by using an easy date picker.Creating date fieldsTo create a date field:​​​1. On the​Organization profile​​ page, go to the ​Overview​​ tab or ​Resources​ tab. Click the ​New resource​ button and select ​Other resources.​​​2. In the ​Add new resource​ window, set the following and click ​Continue​​.In the ​Title​​ field, provide a name of the field you want to add. For example, let us add a field calledReview date.From the ​Choose type​section, select the ​Metadata field - date​​option.From theChoose one or more collectionsdropdown, select theMetadata profilecollection.​3. In the ​Edit resource​ window, set the rest of the properties for the field and click the ​Save​​ button.​Display order:​​Set the order for the field.​Page visibility:​​Select if the field should be always displayed on the resource page or if should be hidden when it is empty.​​​Edit modal visibility:​​For fields that are used less often, define them as additional properties so that they show as secondary field under an ​Add new field​​ dropdown on the page where the field values are defined and edited.Edit permissions:​Select ​Yes​​ if users should be able to edit the value from the UI.​​Hover hint:​​Provide a help text to give context to your users about the field when they are viewing the field values.​​Edit hint:Provide a help text to give context to your users for what values they should provide while they are editing the field.​​External access:​​Select ​Access through API ​​if you want the field to be available for use by APIs.​​Filter by this field in search:​​This allows you to make the field available as a filter on the search results page. We recommend not enabling this for date fields.​On the date field page that you just created, go to theRelatedtab.Click ​​Add related resource​​and select, ​Type​​. In the window that opens, select the resources that should use this date field. By default, the field gets added to the ​Informational​ section. You can change it from the ​Sections​​ tab of the window.​5.Publish the changes.​6. In the ​Sandbox​​ organization, go to the resource page for which you added the date field. You can now use the special field with the date field control and set the value.",
    "url": "https://implementation.data.world/docs/create-a-date-field"
  },
  {
    "title": "Create freeform fields",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.Types of freeform fieldsYou can createsingle line fieldsandmultiline fields.The main difference between the two types of fields is that you can useMarkdownto enhance the content of a multiline field to create a richer experience for the users of the catalog.Creating free form fieldsTo create a free form field:​​​1. On the​Organization profile​​ page, go to the ​Overview​​ tab or ​Resources​ tab. Click the ​New resource​ button and select ​Other resources.​​​2. In the ​Add new resource​ window, set the following and click ​Continue​​.In the ​Title​​ field, provide a name of the field you want to add. For example, let us add a field calledReview date.From the ​Choose type​section, select the ​Metadata field - freeform​​option.From theChoose one or more collectionsdropdown, select theMetadata profilecollection.​3. In the ​Edit resource​ window, set the rest of the properties for the field and click the ​Save​​ button.​Display order:​​Set the order for the field.​Page visibility:​​Select if the field should be always displayed on the resource page or if should be hidden when it is empty.​​​Edit modal visibility:​​For fields that are used less often, define them as additional properties so that they show as secondary field under an ​Add new field​​ dropdown on the page where the field values are defined and edited.Edit permissions:​Select ​Yes​​ if users should be able to edit the value from the UI.​​Hover hint:​​Provide a help text to give context to your users about the field when they are viewing the field values.​​Edit hint:​​ Provide a help text to give context to your users for what values they should provide while they are editing the field.​​External access:​​Select ​Access through API​​if you want the field to be available for use by APIs.​​Filter by this field in search:​​This allows you to make the field available as a filter on the search results page. We recommend not enabling this for freeform fields.​Field size: Select fromMultilineorSingle line. Note thatMultilinefields supportsupports Markdowncontent for creating a richer experience. ForSingle linefields, users can use simple markdown syntax, such as, hyperlinks.On the free form field page that you just created, go to theRelatedtab.Click ​​Add related resource​​and select, ​Type​​. In the window that opens, select the resources that should use this field. By default, the field gets added to the ​Informational​ section. You can change it from the ​Sections​​ tab of the window.​5.Publish the changes.​6. In the ​Sandbox​​ organization, go to the resource page for which you added the date field. You can now use the special field with the date field control and set the value.",
    "url": "https://implementation.data.world/docs/create-a-free-form-field"
  },
  {
    "title": "Create select fields",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.Types of select fieldsYou can create three types of select field:​​Single select field:​​where you can only select one option from the available options.​​​​​Multi select field​​:Where you can select more than one option from the available options.​​​Multi select field with multiple levels of options:​​Where you can select more than one option from the available options at multiple levels.​Create the select field​To create a select field:​​​On the​Organization profile​​ page, go to the ​Overview​​ tab or ​Resources​ tab. Click the ​New resource​ button and select ​Other resources.​​​​In the ​Add new resource​ window, set the following and click ​Continue​​.In the ​Title​ field, provide a name of the field you want to add. For example, let us add a field called ​Review date​​.From the ​Choose type​section, select the ​Metadata field - select​​option.From theChoose one or more collectionsdropdown, select theMetadata profilecollection.​In the ​Edit resource​window, set the following properties for the field and click the ​Save​ button.Display order:​​Set the order for the field.​Page visibility:​​Select if the field should be always displayed on the resource page or if should be hidden when it is empty.​​​Edit modal visibility:​​For fields that are used less often, define them as additional properties so that they show as secondary field under an ​Add new field​​ dropdown on the page where the field values are defined and edited.Edit permissions:​Select ​Yes​​ if users should be able to edit the value from the UI.​​Hover hint:​​Provide a help text to give context to your users about the field when they are viewing the field values.​​Edit hint:​​Provide a help text to give context to your users for what values they should provide while they are editing the field.​​External access:​​Select ​Access through API​​if you want the field to be available for use by APIs.​​Filter by this field in search:​​This allows you to make the field available as a filter on the search results page.​​Type: Select from  ​single-select​​ or ​multi-select​​.​On the select field page that you just created, go to theRelatedtab.Click ​​Add related resource​​and select, ​Type​​. In the window that opens, select the resources that should use this select field. By default, the field gets added to the ​Informational​ section. You can change it from the ​Sections​​ tab of the window.Configure options for the select field dropdownTo configure the options for the select field dropdown:​​After setting up the field, we will set up the value of the field using a spreadsheet and add it to the dataset.In theCatalog Configurationorganization, browse to the​Select metadata fields​​ dataset.Download the sample ​Select_metadata_fields.xlsx​​file. You will notice that it shows how to create values for a Geography field with multiple levels.In the same file or a new Excel file, add a new sheet. Name the sheet exactly what you named the field.❗️You can name the file anything you want but the names of the sheet should exactly match the names of the fields you have created.​4. In the sheet, add a column called ​Level 1​​and under it add the values for the field.​Likewise, to add a multi level field values, add Level 2, Level 3, etc.After you are done, add theExcelfile to the​Select metadata fields​​ dataset.​7.Publish the changes.​8. In the ​Sandbox​​ organization, go to the resource page for which you added the select field. You can now use the select field options to define the value of the field.",
    "url": "https://implementation.data.world/docs/create-select-fields"
  },
  {
    "title": "Publishing changes",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.Follow the process in this document to publish your changes to to the sandbox organization. Once you have tested your changes and they look good to you, publish them to your production environment.To publish the changes:In theCatalog Configurationorganization, browse to theExport Profilesproject.ClickLaunch workspace.In theConnected datasetssection, locate theDDW Catalog Configurationdataset for theCatalog Sandboxorganization.In the dataset, locate theSandbox Metadata Profile.ttlfile, click theSync nowbutton.Go to the Sandbox organization and test your changes.Once you are happy with the configurations, publish the changes to your production organization.6.  In theExport Profilesproject workspace, locate theMain Metadata Profile - Staging.ttlfile and click theSync nowbutton.In theExport Profilesproject workspace, in theConnected datasetssection, locate theDDW Catalog Configurationdataset for the production organization. In the dataset, locate theMain Metadata Profile.ttlfile and click theSync nowbutton.",
    "url": "https://implementation.data.world/docs/publishing-changes"
  },
  {
    "title": "Set up the system for deploying collectors output & MDP",
    "content": "❗️Beta feature!This is a Beta feature andis notgenerally available to all customers at this time.In this section we will walk you through the process of getting your system setup for processing and showing the collector output and the related UI elements (MDP) to your end users. In this example, we will use theTableaucollector. You can follow the same process for the other collectors in system.❗️Feature availabilityCurrently this feature is available for the following collectors.AWS S3DatabricksdbtGoogle BigQueryMANTAMicrosoft SQL ServerOpenAPIOraclePostgreSQLPower BISalesforceSnowflakeTableauIf you want to use it for another collector, contact thedata.world support team.STEP 1: Check availability of datasets and projects for the data sourceFirst, we will check to make sure that the datasets and project for the data source are available and ready for use.🚧This task is performed in theCatalog sourcesorganization.In theCatalog Sourcesorganization, browse to theOrganization profilepage.From theResourcestab, check and verify that the following datasets and projects are available to you:Project:DDW Catalog TableauDataset for the Sandbox organization:DDW Tableau SandboxDataset for the Main organization:DDW Tableau Main📘Organizations with different names!If your organizations are named differently, the datasets will be named accordingly. For example, if the organization is namedGlobal, the dataset name will beDDW Tableau Global.STEP 2: Run the collector🚧This task is performed in theCatalog sourcesorganization.Run the collector.If you are running the collector usingCLI or YAML files., make sure:a.--site:The name for the data.world site into which you will load this catalog. For example, forhttps://YourSiteName.app.data.world/orgName, use--site=\"YourSiteName\". This parameter should not be used for the multi-tenant or VPC instances.b.--account: Is set to point to theCatalog sourcesorganization.c.--upload-location: Is set to the corresponding dataset for the collector available in the ​Catalog Sources​​organization. For example, for Tableau, it will beddw-tableau-catalog-sandboxfor theDDW Tableau Sandboxdataset orddw-tableau-mainfor theDDW Tableau Maindataset depending on which organization you want the output to show in.If you are running the collector using theConnection Manager:a.  Make sure you run the Connection Manager in theCatalog sourcesorganization.b. In the connection manager window, set the dataset asDDW Tableau Sandboxdataset orDDW Tableau Maindataset depending on which organization you want the output to show in.Once the collector has run successfully, browse to the ​collector specific dataset in theCatalog Sources​​ organization. In this example, it is theDDW Tableau Sandboxdataset orDDW Tableau Maindataset. Verify that the output of the collector has been added to the dataset.STEP 3: Add the metadata profile for the collector🚧This task is performed in theCatalog configurationorganization.In the ​Catalog Configuration​​organization, go to theMetadata profilescollection.On the Overview tab, click theEditbutton and from theSourcetab of the window, selectTableau. ClickSave.Next, in the ​Catalog Configuration​​organization, go to theddw-catalogsdataset.  Locate the syncsource-modules.ttlfile in the dataset and click theSync nowbutton. This will load your selected source modules into Catalog Config.You will see a collection with the name of the data source  (in this caseTableau) which has all the MDP configurations related to the data source is added to the organization.STEP 4: Adjust the Collector metadata profile for your business needs🚧This task is performed in theCatalog configurationorganization.Now we will review the contents of the Metadata profile to see if you want to make any changes. When you complete STEP 4, the MDP for the collector are added to 2 places in the organization.The collection specific for the collector, for example,Tableaucollection: This collection is created to preserve a pristine copy of the MDP related to the collector and it should be only used for reference and not edited.TheMetadata profilescollection: An entity must be in theMetadata profilecollection in order for it to sync to your destination organizations for the collector outputs. Therefore, if you want tohidean entity or relationship in your destination organization without deleting it, it can simply be removed from thisMetadata profilecollection.STEP 5: Publish the MDP and collected metadata to end users🚧This task is performed in theMainorSandboxorganization.In theMainorSandboxorganization, go to theddw-catalogsdataset.In the dataset, find the matching file for the collector, and clickSync now.View the results🎉You can now browse to theSandboxorMainorganization and view the metadata collected by theTableaucollector.",
    "url": "https://implementation.data.world/docs/setting-up-your-system-for-collectors"
  }
]